#include <iostream>
#include <string>
void overview(const std::string& name)
{
	if (name == "Бабушка легкого поведения")
	{
		std::cout << "Мастер перевоплощений Саня по прозвищу Трансформер провернул кучу афер, точь-в-точь изображая десятки персонажей. Но в этот раз он украл не у тех… Теперь у парня на хвосте очень плохие люди с пистолетами.Саня решает залечь на дно в доме престарелых в образе пожилой тети.И когда ему казалось, что он попал в безвыходную ситуацию, новый поворот судьбы дарит ему любовь и надежду превратиться в приличного человека.\n";
		std::cout << "Год производства: 2017\nСтрана: Россия\nЖанр: комедия\nРежиссер: Марюс Вайсберг\n";
	}
	if (name == "Обитель Зла")
	{
		std::cout << "В гигантской подземной лаборатории выходит из-под контроля опаснейший вирус и мгновенно превращает своих жертв в прожорливых зомби. Достаточно одного их укуса или царапины, чтобы человек стал обезумевшим пожирателем живой плоти. Военные посылают в кишащий голодными монстрами секретный комплекс отряд спецназа, к которому присоединяются Элис и полицейский Мэтт.У них есть только три часа, чтобы уничтожить вирус.\n";
		std::cout << "Год производства 2002\nСтрана: США, Германия\nЖанр: ужасы, боевик, фантастика\nРежиссер:Пол У.С.Андерсон\n";
	}
	if (name == "Легнеда №17")
	{
		std::cout << "2 сентября 1972 года. Монреаль. Хоккейная сборная СССР с разгромным счетом 7:3 победила канадских профессионалов из НХЛ в стартовом матче эпохальной Суперсерии СССР-Канада. Это была не просто игра, это была битва за свою страну, которая перевернула мировое представление о хоккее. Теперь весь мир знал его просто по номеру «17». Валерий Харламов, забивший в том матче 2 шайбы мгновенно взлетел на вершину славы. Сбылась его мечта –упорство, спортивный талант и суровые уроки великого тренера Анатолия Тарасова сделали из «номера 17» легенду мирового хоккея.";
		std::cout << "Год производства: 2012\nСтрана: Россия\nЖанр: биография, спорт, драма\nРежиссер: Николай Лебедев\n";
	}
	if (name == "Барби")
	{
		std::cout << "Самая обыкновенная стереотипная Барби живёт в великолепном розовом Барбиленде, и каждый её день идеален. Она меняет наряды, загорает на пляже, проводит время с другими Барби, день заканчивается шумной вечеринкой с танцами, и в этой позитивной кутерьме с блёстками влюблённый Кен — всего лишь приложение к Барби. Однажды куклу посещают мысли о смерти, и её сделанные под туфли с каблуками ноги вдруг становятся плоскими. Чтобы разобраться в происходящем и вернуть привычный пластмассовый мир, Барби придётся отправиться в мир реальный и найти там свою девочку-хозяйку. За ней увязывается не мыслящий жизни без своего кумира Кен.";
		std::cout << "Год производства: 2023\nСтрана: США, Великобритания\nЖанр: комедия, приключения, фэнтези\nРежиссер: Грета Гервиг";
	}
}